Config/Catalogs/QuantityCalculationRules.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>QuantityCalculationRules</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>PeriodInHours</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReferenceHourIsUsed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReferenceHour</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuantityCalculationRuleType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuantityCalculationRuleTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalAlgorithm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomExaminationFreeOfChargeTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FreeOfChargeChangeRoomTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FreeOfChargeCheckOutDelayTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByHoursCheckOutDelayTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByQuarterOfADayCheckOutDelayTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByHalfOfADayCheckOutDelayTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Do1DayCheckOutDelayCharge</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckOutDelayRoundingRule</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuantityRoundingRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FreeOfChargeEarlyCheckInTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByHoursEarlyCheckInTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByQuarterOfADayEarlyCheckInTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByHalfOfADayEarlyCheckInTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Do1DayEarlyCheckInCharge</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EarlyCheckInRoundingRule</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuantityRoundingRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByHoursTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByQuarterOfADayTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeByHalfOfADayTime</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckInRoundingRule</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuantityRoundingRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CalculateDelayFromCheckOutTimeForFirstDay</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstDayStartsAtReferenceHourTime</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstDayEndsAtReferenceHourTime</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomChangeAlwaysAtReferenceHourTime</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForeignersOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CitizensOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotChargeInReservations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeMealsAtFirstDay</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoundQuantity</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoundQuantityDigits</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/QuantityCalculationRuleTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>QuantityCalculationRuleTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Accommodation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReferenceHourTransfers</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Breakfast</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BreakfastServiceDateShift</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Daily</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Monthly</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NumberOfDays</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OneTimeCharge</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Reservation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LateCheckOut</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EarlyCheckIn</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EarlyCheckInNoDateShift</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HotelProduct</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VaucherWithDurationFixedInRate</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Int</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Precise</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Round</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Full</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>External</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hostel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ResortFeeRu2018</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ResortFeeRu2018CO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ResortFeeRu2022</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/QuantityCalculationRules/Forms/tcItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;
	If Not cmCheckUserPermissions("HavePermissionToManagePrices") Then
		If NOT ValueIsFilled(Object.Ref) Then
			pCancel = True;
			tcCommonFunctionOnClientServer.TextMessage(NStr("en = 'You do not have rights for services and prices management!'; de = 'Sie haben keine Rechte, Dienstleistungen und Preise zu verwalten!'; ru = 'Нет прав на управление услугами и ценами!'"));
		Else
			ReadOnly = True;
		EndIf;		
	EndIf;
	// Form items appearance
	RefreshItemsAppearance();
	// Let's set the properties of the form
	tcProtection.SetFormProperties(ThisObject);
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure QuantityCalculationRuleTypeOnChange(pItem)
	RefreshItemsAppearance();
EndProcedure // QuantityCalculationRuleTypeOnChange

#EndRegion

#Region Private

// --------------------------------------------------------------------------------
&AtServer
Procedure RefreshItemsAppearance()
	If Object.QuantityCalculationRuleType = Enums.QuantityCalculationRuleTypes.External Then
		Items.ExternalAlgorithm.Enabled = True;
	Else
		Items.ExternalAlgorithm.Enabled = False;
		If ValueIsFilled(Object.ExternalAlgorithm) Then
			Object.ExternalAlgorithm = Undefined;
		EndIf;
	EndIf;
EndProcedure // RefreshItemsAppearance

#EndRegion
